In [2]:
import pandas as pd
import numpy as np
import sys
#使用pandas的内置函数read_csv read_json等进行文本文件的读取

In [3]:
file_name = r'C:\Users\zhaolei\Desktop\利用Python进行数据分析\examples\ex1.csv'
file_root = r'C:\Users\zhaolei\Desktop\利用Python进行数据分析\examples\ex'
print(file_root + '2.csv')

C:\Users\zhaolei\Desktop\利用Python进行数据分析\examples\ex2.csv

In [4]:
df = pd.read_csv(file_name)

In [5]:
df

   a  b  c  d    message
0  a  b  c  d      hello
1  a  b  c  d      world
2  a  b  c  d      hello
3  a  b  c  d      china
4  a  b  c  d      hello
5  a  b  c  d  chongqing

In [6]:
df = pd.read_table(file_name, sep=',') # 指定分隔符

In [7]:
df

   a  b  c  d    message
0  a  b  c  d      hello
1  a  b  c  d      world
2  a  b  c  d      hello
3  a  b  c  d      china
4  a  b  c  d      hello
5  a  b  c  d  chongqing

In [8]:
df

   a  b  c  d    message
0  a  b  c  d      hello
1  a  b  c  d      world
2  a  b  c  d      hello
3  a  b  c  d      china
4  a  b  c  d      hello
5  a  b  c  d  chongqing

In [9]:
pd.read_csv(file_name, header=None, names=list('abcde'))

   a  b  c  d          e
0  a  b  c  d    message
1  a  b  c  d      hello
2  a  b  c  d      world
3  a  b  c  d      hello
4  a  b  c  d      china
5  a  b  c  d      hello
6  a  b  c  d  chongqing

In [10]:
pd.read_csv?

In [11]:
name = list('abcd')

In [12]:
name.append('message') # 返回none

In [13]:
name

['a', 'b', 'c', 'd', 'message']

In [14]:
pd.read_csv(file_name, names=name, index_col='a') # 会指定message为index

   b  c  d    message
a
a  b  c  d    message
a  b  c  d      hello
a  b  c  d      world
a  b  c  d      hello
a  b  c  d      china
a  b  c  d      hello
a  b  c  d  chongqing

In [15]:
file_name2 = file_root + '2.csv'

In [16]:
file_name2

'C:\\Users\\zhaolei\\Desktop\\利用Python进行数据分析\\examples\\ex2.csv'

In [17]:
df2 = pd.read_table(file_name2, sep=',', header=0, index_col=['key1', 'key2'], comment='\n') # 创建分层索引

In [18]:
df2.loc['one'] # 访问one层 借助分层索引 可以将多维数据降维

      value1  value2
key2
a          1       2
b          3       4
c          5       6

In [24]:
re_sep = '\s+'

In [25]:
re_sep

'\\s+'

In [33]:
result = pd.read_table(file_root+'3.txt', sep=re_sep, engine='python', comment='#')

In [34]:
result.loc['ccc', 'C'] = 10

In [35]:
result

                 A     B     C
aaa      -0.264438    92  23.0
bbb  981112.200000  nuil   NaN
ccc       2.000000   NaN  10.0

In [41]:
data = pd.read_csv(file_root+'3.txt', sep=re_sep, comment='#', na_values=['NULL']) # 是按照0开始的

In [42]:
data

                 A     B     C
aaa      -0.264438    92  23.0
bbb  981112.200000  nuil   NaN
ccc       2.000000   NaN   NaN

In [43]:
data.isnull()

         A      B      C
aaa  False  False  False
bbb  False  False   True
ccc  False   True   True

In [44]:
data[data.isnull()]

      A    B   C
aaa NaN  NaN NaN
bbb NaN  NaN NaN
ccc NaN  NaN NaN

In [45]:
nan_list = {'Aa':['2'],
           'B':['NULL']}

In [46]:
data = pd.read_csv(file_root+'3.txt', header=0, sep=re_sep, skiprows=[4, 6], comment='#', engine='python', thousands=',') # 是按照0开始的

In [47]:
data

                 A     B     C
aaa      -0.264438    92  23.0
bbb  981112.200000  nuil   NaN
ccc       2.000000   NaN   NaN

In [48]:
pd.options.display.max_rows = 10 # 设置数据的显示格式

In [49]:
result = pd.read_csv('examples/ex6.csv')

In [50]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [51]:
result = pd.read_csv('examples/ex6.csv', nrows=10)

In [52]:
result

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q
5  1.817480  0.742273  0.419395 -2.251035   Q
6 -0.776764  0.935518 -0.332872 -1.875641   U
7 -0.913135  1.530624 -0.572657  0.477252   K
8  0.358480 -0.497572 -0.367016  0.507702   S
9 -1.740877 -1.160417 -1.637830  2.172201   G

In [53]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)

In [54]:
chunker

In [55]:
tot = pd.Series([ ],dtype=object) # 指定类型

In [56]:
tot

Series([], dtype: object)

In [57]:
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0) # Series 使用add完成相加 对应的值相加 没有值则为0 再加
tot = tot.sort_values(ascending=False) # 逆序

In [58]:
tot[:10] # 索引前10个

E    368
X    364
L    346
O    343
Q    340
M    338
J    337
F    335
K    334
H    330
dtype: object

In [59]:
data.to_csv('examples/out.csv')

In [60]:
data

                 A     B     C
aaa      -0.264438    92  23.0
bbb  981112.200000  nuil   NaN
ccc       2.000000   NaN   NaN

In [61]:
info = pd.read_csv('examples/out.csv', names=list('abcd'), header=None, index_col='a')

In [62]:
info

             b     c     d
a
NaN          A     B     C
aaa  -0.264438    92  23.0
bbb   981112.2  nuil   NaN
ccc        2.0   NaN   NaN

In [63]:
info.to_csv(sys.stdout, sep='|', na_rep='NULL') # 输出到sys

a|b|c|d
NULL|A|B|C
aaa|-0.264438|92|23.0
bbb|981112.2|nuil|NULL
ccc|2.0|NULL|NULL

In [64]:
info.to_csv?

In [65]:
info.to_csv(sys.stdout, sep=',', header=False, index=False, na_rep='NULL')

A,B,C
-0.264438,92,23.0
981112.2,nuil,NULL
2.0,NULL,NULL

In [66]:
data

                 A     B     C
aaa      -0.264438    92  23.0
bbb  981112.200000  nuil   NaN
ccc       2.000000   NaN   NaN

In [67]:
data.to_csv('examples\out.csv', sep=',', header=False, index=False, na_rep='NULL', columns=['B', 'A'])

In [68]:
data = pd.read_csv('examples\out.csv', delimiter=',', header=None, names=list('ABC'), usecols=['A', 'B'], engine='python')

In [69]:
data

      A              B
0    92      -0.264438
1  nuil  981112.200000
2   NaN       2.000000

In [70]:
# Series也有to_csv的方法
dates = pd.date_range('1/1/2000', periods=7)

In [71]:
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [72]:
ts = pd.Series(np.arange(7), index=dates) # 利用时间作index

In [73]:
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

In [74]:
ts.to_csv(sys.stdout, sep=',', header=False)

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [85]:
import csv
f = open('examples/ex7.csv')
reader = csv.reader(f)

In [86]:
reader

In [87]:
for line in reader:
    print(line)
f.close()

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [88]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))
    reader = csv.reader(f, dialect=my_dialect)

In [89]:
header, values = lines[0], lines[1:]

In [108]:
data_dict = {h:v for h, v in zip(header, zip(*values))}

In [109]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [111]:
class my_dialect(csv.Dialect):
    """使用继承的方式创建自己的csv对象"""
    lineterminator = '\n'
    delimiter = ','
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [112]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))
    reader = csv.reader(f, dialect=my_dialect)
    for line in reader:
        print(line)

In [113]:
reader

In [114]:
with open('my_data.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))

In [115]:
with open('my_data.csv') as f:
    reader = csv.reader(f, dialect=my_dialect)
    print(list(reader))
    for line in reader:
        print(line)

[['one', 'two', 'three'], ['1', '2', '3']]

In [116]:
with open('my_data.csv') as f:
    reader = csv.reader(f, dialect=csv.excel)
    print(list(reader))
    for line in reader:
        print(line)

[['one', 'two', 'three'], ['1', '2', '3']]

In [117]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet":null,
"siblings":[{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
            {"name": "Katie", "age": 38,
            "pets": ["Sixes", "Stache", "Cisco"]}]}
"""

In [119]:
import json

In [120]:
result = json.loads(obj)

In [121]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [122]:
asjson = json.dumps(result)

In [123]:
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [128]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [129]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [130]:
data = {'state':['Ohio', 'Ohio', 'Nevida'],
       'name': [2001, 2001, 2111]}

In [133]:
data['state']

['Ohio', 'Ohio', 'Nevida']

In [132]:
import pandas as pd

In [138]:
df = pd.DataFrame(data, index=range(len(data['state'])), columns=['fuck'])

In [139]:
df

  fuck
0  NaN
1  NaN
2  NaN

In [141]:
data2 = np.arange(20).reshape(4,5)

In [150]:
df = pd.DataFrame(data2, columns=['fuck', 'wjs', 'wss', 'sss', 'sss'])

In [152]:
df.columns

Index(['fuck', 'wjs', 'wss', 'sss', 'sss'], dtype='object')

In [155]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age', 'pets'])

In [160]:
siblings['pets'][0][0][0]

'Z'

In [165]:
data = pd.read_json('examples/example.json')

In [166]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [167]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [170]:
print(data.to_json('examples/example2.json',orient='records'))

None

In [172]:
pd.read_json('examples/example2.json')

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [174]:
data.to_json?

In [180]:
print(data.to_json('examples/example3.json', orient='table'))

None

In [182]:
pd.read_json('examples/example3.json', orient='table')

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [183]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')

In [185]:
failures = tables[0] # ??为什么就变成了dataframe??

In [188]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [187]:
tables

[                             Bank Name             City  ST   CERT  \
 0                          Allied Bank         Mulberry  AR     91
 1         The Woodbury Banking Company         Woodbury  GA  11297
 2               First CornerStone Bank  King of Prussia  PA  35312
 3                   Trust Company Bank          Memphis  TN   9956
 4           North Milwaukee State Bank        Milwaukee  WI  20364
 ..                                 ...              ...  ..    ...
 542                 Superior Bank, FSB         Hinsdale  IL  32646
 543                Malta National Bank            Malta  OH   6629
 544    First Alliance Bank & Trust Co.       Manchester  NH  34264
 545  National State Bank of Metropolis       Metropolis  IL   3815
 546                   Bank of Honolulu         Honolulu  HI  21029

                    Acquiring Institution        Closing Date  \
 0                           Today's Bank  September 23, 2016
 1                            United Bank     August 19, 2016
 2    First-Citizens Bank & Trust Company         May 6, 2016
 3             The Bank of Fayette County      April 29, 2016
 4    First-Citizens Bank & Trust Company      March 11, 2016
 ..                                   ...                 ...
 542                Superior Federal, FSB       July 27, 2001
 543                    North Valley Bank         May 3, 2001
 544  Southern New Hampshire Bank & Trust    February 2, 2001
 545              Banterra Bank of Marion   December 14, 2000
 546                   Bank of the Orient    October 13, 2000

           Updated Date
 0    November 17, 2016
 1    November 17, 2016
 2    September 6, 2016
 3    September 6, 2016
 4        June 16, 2016
 ..                 ...
 542    August 19, 2014
 543  November 18, 2002
 544  February 18, 2003
 545     March 17, 2005
 546     March 17, 2005

 [547 rows x 7 columns]]

In [189]:
# 计算时间
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [198]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

In [199]:
from lxml import objectify

In [200]:
# path = 'examples/mta_perf/Performance_MNR.xml'
# parsed = objectify.parse(open(path))

FileNotFoundError: [Errno 2] No such file or directory: 'examples/mta_perf/Performance_MNR.xml'

In [201]:
from io import StringIO

In [202]:
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [203]:
root

In [204]:
root.get('href') # 为什么要使用get

'http://www.google.com'

In [205]:
root.text

'Google'

AttributeError: no such child: href

In [216]:
a = {'hello', 'world'}

In [217]:
a

{'hello', 'world'}

In [218]:
import pickle

In [219]:
file_name = 'examples/pickle_test.pickle'
with open(file_name, 'wb') as f:
    pickle.dump(a, f)

In [220]:
with open(file_name, 'rb') as f:
    b = pickle.load(f)
    print(b)

{'hello', 'world'}

In [221]:
a = pd.DataFrame(np.arange(20).reshape(4,5))

In [222]:
a

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [223]:
a.to_pickle(file_name)

In [224]:
pd.read_pickle?

In [225]:
frame = pd.DataFrame({'a': np.random.randn(100)})

In [226]:
store = pd.HDFStore('mydata.h5')

In [227]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [228]:
store['obj1'] = frame

In [229]:
store['obj1_col'] = frame['a']

In [231]:
store['obj1_col']

0     0.305682
1     0.083661
2    -1.303681
3     0.145010
4    -0.266779
        ...
95    0.000684
96    0.055461
97   -0.602502
98   -1.159951
99   -0.387498
Name: a, Length: 100, dtype: float64

In [238]:
store.put('obj2', frame, format='table')

In [239]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [240]:
store.select('obj2', where=['index >= 10 and index <= 15']) # table

           a
10  1.306785
11  0.660609
12 -0.473582
13  1.085413
14 -0.046849
15 -0.926504

In [242]:
store.close()

In [243]:
data = pd.HDFStore('mydata.h5') # 创建HDF类对象 然后使用其属性进行访问

In [245]:
data['obj2']

           a
0   0.305682
1   0.083661
2  -1.303681
3   0.145010
4  -0.266779
..       ...
95  0.000684
96  0.055461
97 -0.602502
98 -1.159951
99 -0.387498

[100 rows x 1 columns]

In [249]:
frame.to_hdf('my_data.h5', 'obj3', format='table')

In [251]:
pd.read_hdf('my_data.h5', 'obj3', where=['index < 10'])

          a
0  0.305682
1  0.083661
2 -1.303681
3  0.145010
4 -0.266779
5  1.324323
6  0.436247
7  0.155406
8  0.343526
9  0.721737

In [268]:
# Excel 表格读写
xlsx = pd.ExcelFile('examples/ex1.xlsx') # 创建Excel文件对象 对多Sheet处理的情况下速度更快
frame = pd.read_excel(xlsx, 'Sheet1') # 读取后直接转换为DataFrame

In [266]:
type(frame)

pandas.core.frame.DataFrame

In [270]:
frame = pd.read_excel('examples/ex1.xlsx', 'Sheet1')

In [271]:
pd.read_excel?

In [275]:
file_name = 'examples/ex2.xlsx' # 文件格式不要出错
file_root = 'examples'
writer = pd.ExcelWriter(file_name)

In [278]:
frame.to_excel(writer, 'Sheet1')

In [279]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [289]:
frame.to_excel(file_name, 'Sheet1') # 为什么会覆盖工作表的名字

In [290]:
reader = pd.ExcelFile(file_name)

In [292]:
data = pd.read_excel(reader, 'Sheet1')

In [293]:
data

   Unnamed: 0  Unnamed: 0.1  a   b   c   d message
0           0             0  1   2   3   4   hello
1           1             1  5   6   7   8   world
2           2             2  9  10  11  12     foo

In [297]:
# 和Web API交互
import requests

In [323]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [324]:
resp = requests.get(url)

In [325]:
resp # 200代表状态正确

In [326]:
data = resp.json()

In [330]:
data[0]['title']

'Fixed Unicode decoding error in `Period.strftime` when a locale-specific directive is used'

In [331]:
issues = pd.DataFrame(data, columns=['number', 'title', 'labels', 'state'])

In [329]:
issues

,number,title,labels,state
0,46405,Fixed Unicode decoding error in `Period.strfti...,[],open
1,46404,REGR: DataFrame.replace when the replacement v...,"[{'id': 32815646, 'node_id': 'MDU6TGFiZWwzMjgx...",open
2,46403,"Revert "" BUG: RecursionError when attempting t...","[{'id': 32815646, 'node_id': 'MDU6TGFiZWwzMjgx...",open
3,46402,BUG: Pandas isn't able to read compressed file...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
4,46401,CI: Use shared dependency file for ARM,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
...,...,...,...,...
25,46371,BUG: string series to numpy array conversion,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
26,46369,SeriesGroupBy.apply results in wrong name when...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
27,46367,BUG: Fix remaining cases of groupby(...).trans...,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open
28,46365,DOC: read_csv using pyarrow and a different en...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
29,46364,DOC: Adding Korean translation version of Pand...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open

In [333]:
import sqlite3

In [334]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
c REAL, d INTEGER);
"""

In [335]:
con = sqlite3.connect('mydata.sqlite')

In [336]:
con.execute(query)

In [337]:
con.commit() # ??? 什么是commit

In [338]:
data = [('Atlana', "Georgia", 1.25, 6),
       ("Tallahassee", "Florida", 2.6, 3)]

In [339]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [340]:
con.executemany(stmt, data)

In [341]:
con.commit()

In [342]:
cursor = con.execute('select * from test')

In [343]:
rows = cursor.fetchall()

In [344]:
rows

[('Atlana', 'Georgia', 1.25, 6), ('Tallahassee', 'Florida', 2.6, 3)]

In [345]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [347]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description]) # 指定在其中使用的行

             a        b     c  d
0       Atlana  Georgia  1.25  6
1  Tallahassee  Florida  2.60  3

In [348]:
import sqlalchemy as sqla

In [351]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [352]:
pd.read_sql('select * from test', db) # 读取sql操作

             a        b     c  d
0       Atlana  Georgia  1.25  6
1  Tallahassee  Florida  2.60  3